<?php

return [

    /*
    |--------------------------------------------------------------------------
    | パスワードリセット言語行
    |--------------------------------------------------------------------------
    |
    | 以下の言語行は既存のパスワードを無効にしたい場合に、無効なトークンや
    | 新しいパスワードが入力された場合のように、パスワードの更新に失敗した
    | 理由を示すデフォルトの文言です。
    |
    */

    'reset' => 'パスワードをリセットしました。',
    'sent' => 'パスワード再設定メールを送信しました。',
    'throttled' => '送信に失敗しました。しばらく経ってから送信して下さい。',
    'token' => 'このパスワードリセットフォームは無効です。',
    'user' => "メールアドレスに一致するユーザーがいません。",
    
];
