app/Http/Controllers/TodoController.php

select * from `todos`
---
    public function __construct()
    {
        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('id'); //todoのidを取得
            if(!is_null($id)) { //idのnull判定
                $todoId = Todo::findOrFail($id)->user_id;
                if($todoId !== Auth::id()) {
                    abort(404);
                }
            }

            return $next($request);
        });

select * from `todos` where `id` in ('17')
---
    public function edit($id)
    {
        $todo = Todo::find($id);